Documents/ВводДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВводДенежныхСредств</Name>
			<BasedOn>
				<xr:Item>Document.ПоручениеНаДвижениеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствамПоПоручениям</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваПереданныеВОплатуПаев</xr:Item>
				<xr:Item>AccumulationRegister.ВводыВыводыАктивовВВалютеУчета</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваНаличные</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
				<xr:Item>InformationRegister.РеестрПлатежей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пай</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаБанковскойВыписки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтрокаБанковскойВыписки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчетЕПС</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС1</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС2</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубконтоЕПС3</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДоговорТекстом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровДоверительногоУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйИнвестиционныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиАкционерныхИнвестиционныхФондов</Name>
					<Comment>Управление активами АИФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПаевогоИнвестиционногоФонда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиСаморегулируемыхОрганизаций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФизическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиФОГФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЮридическогоЛица</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеИмуществомСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиНакоплениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПенсионнымиРезервами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеРезервамиСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеСобственнымиСредствамиПенсионныхФондов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеАктивамиЦелевыхКапиталов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СчетаДоверительногоУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СчетаДоверительногоУправления</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Comment>Числовая часть кода счета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаключения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециализированныйДепозитарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьКотировок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиКонсолидированныйБухгалтерскийУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораПоУправлениюПенсионнымиНакоплениямиИРезервами</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровПоУправлениюПенсионнымиНакоплениямиИРезервами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеИспользованияЦелевогоКапитала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетныеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РасчетныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВводДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		РаботаСДокументами.ПроверитьВозможностьСозданияПодчиненногоДокументаНаОснованииПоручения(Объект, Отказ);	
	КонецЕсли;
		
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("Брокер");
	КонецЕсли;
	
	Если ЭтаФорма.ДетализацияПоРасчетномуСчету Тогда
		ПроверяемыеРеквизиты.Добавить("РасчетныйСчет");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ЗаполнитьПодтверждениеОперацииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	РаботаСЖурналамиОперацийКлиентСервер.ОповеститьЖурналыОбИзменении();
	
	РаботаСДокументамиКлиент.ПроверитьПараметрыПодтвержденияОперации(ЭтаФорма, Объект, ПараметрыЗаписи);
	
	Если ТребуетсяНачислениеВознагражденияЗаРазмещение(Объект.Дата, Объект.СчетДоверительногоУправления, Объект.ВидОперации) Тогда // начислим задолженность по вознаграждению
		
		Если ЭтаФорма.ЭтоНовыйДокумент Тогда
			// для нового проведенного документа подчиненный приход % создается без доп. подтверждения
			Если Объект.Проведен Тогда
				СоздатьНачислениеВознагражденияЗаРазмещение(Объект.Ссылка);
			КонецЕсли;
			
			ЭтаФорма.ЭтоНовыйДокумент = Ложь;
			
		// При отмене проведения не проверяем	
		ИначеЕсли ПараметрыЗаписи.РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
			НачислениеВознагражденияЗаРазмещение = НайтиНачислениеВознагражденияЗаРазмещение(Объект.Ссылка);
			
			// Комплект замороченных проверок. В итоге не должны проводить документ ввода ДС, если нет синхронизации с документом начисления задолженности.
			Если Не ЗначениеЗаполнено(НачислениеВознагражденияЗаРазмещение) Тогда
								
				ЭтоРежимПроведения = РаботаСДокументами.ЭтоРежимПроведения(Объект.Ссылка, ПараметрыЗаписи.РежимЗаписи);
				ТекстВопроса = "Создать начисление задолженности по вознаграждению за размещение?";
				Если ЭтоРежимПроведения Тогда
					ТекстВопроса = ТекстВопроса + " При отказе будет отменено проведение текущего документа!";
				КонецЕсли;
				
				Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					СоздатьНачислениеВознагражденияЗаРазмещение(Объект.Ссылка);
				ИначеЕсли ЭтоРежимПроведения Тогда					
					ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
					Записать(ПараметрыЗаписи);
				КонецЕсли;
				
			ИначеЕсли ЗначениеЗаполнено(НачислениеВознагражденияЗаРазмещение) И НачислениеВознагражденияЗаРазмещениеТребуетСинхронизации(НачислениеВознагражденияЗаРазмещение, Объект.Дата, Объект.СчетДоверительногоУправления) Тогда
				
				ЭтоРежимПроведения = РаботаСДокументами.ЭтоРежимПроведения(Объект.Ссылка, ПараметрыЗаписи.РежимЗаписи);
				ТекстВопроса = "Перезаполнить начисление задолженности по вознаграждению за размещение?";
				Если ЭтоРежимПроведения Тогда
					ТекстВопроса = ТекстВопроса + " При отказе будет отменено проведение текущего документа!";
				КонецЕсли;
				
				Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					ОткрытьФорму("Документ.НачислениеЗадолженности.ФормаОбъекта", Новый Структура("Ключ, ПараметрыПерезаполнения", НачислениеВознагражденияЗаРазмещение, Новый Структура("Основание", Объект.Ссылка)));					
				ИначеЕсли ЭтоРежимПроведения Тогда					
					ПараметрыЗаписи.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
					Записать(ПараметрыЗаписи);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Оповестить("БанковкиеВыписки.Обновить");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") И ИсточникВыбора.ИмяФормы = "Документ.СтрокаБанковскойВыписки.Форма.БанковкиеВыписки" Тогда
		Если ИсточникВыбора.ИсточникВыбора = "СтрокаБанковскойВыписки" Тогда
			Объект.СтрокаБанковскойВыписки = ВыбранноеЗначение;
			
			ЗаполнитьЗначенияСвойств(Объект,
				ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВыбранноеЗначение, "Контрагент, РасчетныйСчетКонтрагента"));
				
			Объект.КонтрагентДоговорТекстом = РаботаСДокументами.ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(													
													Объект.Организация, 
													Объект.Контрагент,											
													Объект.РасчетныйСчетКонтрагента, 
													ЭтаФорма.ТипПередачи = 1, 
													Объект.Дата);
			ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
		КонецЕсли;
		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПодтверждениеОперации" Тогда
		Если Параметр = Объект.Ссылка
			ИЛИ (ТипЗнч(Параметр) = Тип("Массив") И Параметр.Найти(Объект.Ссылка) <> Неопределено)
		Тогда
			ЗаполнитьПодтверждениеОперациинаСервере();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_ЭЛЕМЕНТОВ_ШАПКИ_ФОРМЫ

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Не РаботаСИсполнителями.ЕстьИсполнитель("ИсполнителиПоДенежнымСредствамСобственные",
		ОбщегоНазначенияКлиентСервер.ПоляВСтруктуру(Объект, "Дата, Организация, СчетДоверительногоУправления, РасчетныйСчет"))
	Тогда
		Объект.РасчетныйСчет = Неопределено;
	КонецЕсли;
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержанногоВознаграждения")
	 ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратИзлишнеУдержаннойКомиссии") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Проведение операции по виду %1 производится документами Начисление задолженности и Оплата", Объект.ВидОперации), Объект.Ссылка,, "Объект.ВидОперации");
		Объект.ВидОперации = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если Объект.ВидОперации <> ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами") Тогда
		Объект.Брокер = Неопределено;
	КонецЕсли;
		
	НовыйСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ВидОперации);
	
	Если НовыйСчет <> Объект.КоррСчет Тогда
		Если ЗначениеЗаполнено(Объект.КоррСчет) Тогда
			Если Вопрос("Заменить корр. счет на " + НовыйСчет + "?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.КоррСчет = НовыйСчет;
				КоррСчетПриИзменении(Неопределено);
			КонецЕсли; 	
		Иначе
			Объект.КоррСчет = НовыйСчет;
			КоррСчетПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли; 
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	НастроитьПараметрыОтбораОснования();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьТипПередачиИКонтрагента();
	
	ЗаполнитьСубконто1НаСервере();
	НастроитьПараметрыОтбораОснования();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормаДенежныхСредствПриИзменении(Элемент)
	
	Если      Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная") Тогда
		Объект.Касса = Неопределено;
		
	ИначеЕсли Объект.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Наличная") Тогда
		Объект.РасчетныйСчет            = Неопределено;
		Объект.Брокер                   = Неопределено;
		Объект.РасчетныйСчетКонтрагента = Неопределено;
		Объект.СтрокаБанковскойВыписки  = Неопределено;
		
		ЭтаФорма.ОплатаЧерезБрокера = 0;
		
		БрокерПриИзменении(Неопределено);
		
	КонецЕсли;
		
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаЧерезБрокераПриИзменении(Элемент)
	
	Если ЭтаФорма.ОплатаЧерезБрокера = 0 Тогда
		Объект.Брокер = Неопределено;
	КонецЕсли;
	
	БрокерПриИзменении(Неопределено);
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
	
	РаботаСДокументамиКлиент.ДетализацияПоРасчетномуСчетуПриИзмененииСвязанныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) И ЗначениеЗаполнено(Объект.Валюта) Тогда
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
	Иначе
		Возврат;
	КонецЕсли;
	
	Если Объект.Валюта <> ВалютаРасчетногоСчета Тогда
		
		Если ЗначениеЗаполнено(Объект.Валюта) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменена валюта " + Объект.Валюта + " на " + ВалютаРасчетногоСчета + " из расчетного счета.");
		КонецЕсли;
		
		Объект.Валюта = ВалютаРасчетногоСчета;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КассаПриИзменении(Элемент)
	
	Объект.Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Касса, "ВалютаДенежныхСредств");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ЗаполнитьСубконто1НаСервере();
	
	ОбработатьРасчетныйСчетПриИзмененииКонтрагента();
	
	УстановитьТекстКонтрагентаДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["Субконто" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	ЗаполнитьСубконто1НаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоррСчетЕПСПриИзменении(Элемент)
	
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
	Для Инд = 1 По 3 Цикл
		Если НЕ ЭтаФорма.Элементы["СубконтоЕПС" + Строка(Инд)].Доступность Тогда
			Объект["Субконто" + Строка(Инд)] = Неопределено;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаБанковскойВыпискиНажатие(Элемент, СтандартнаяОбработка)
	
	РаботаСБанковскимиВыпискамиКлиентСервер.ВыполнитьДействиеСоСтрокойБанковскойВыписки(
		Новый Структура("Период, Организация, РасчетныйСчет, Контрагент, ВидДвижения, Сумма, РасчетныйСчетКонтрагента",
			Объект.Дата,
			Объект.Организация,
			Объект.РасчетныйСчет,
			Объект.Контрагент,
			ПредопределенноеЗначение("Перечисление.ВидыДвижений.Приход"),
			Объект.Сумма,
			Объект.РасчетныйСчетКонтрагента),
		"СтрокаБанковскойВыписки",
		ЭтаФорма,
		СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика") И ЗначениеЗаполнено(Объект.Основание) Тогда
		ОбновитьТипПередачиИКонтрагента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПередачиПриИзменении(Элемент)
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(Объект.Дата, ЭтаФорма.ТипПередачи, Объект.Организация, Объект.СчетДоверительногоУправления);
	
	УстановитьТекстКонтрагентаДоговора();
	
	ОбработатьРасчетныйСчетПриИзмененииКонтрагента();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомандаВыбратьДанныеПоКонтрагенту(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СчетДоверительногоУправленияОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.ДатаОбработкаВыбора(Объект, ЭтаФорма, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчет);
	РаботаСДокументамиКлиент.СверитьВыбранноеЗначениеВалютыСВалютойРасчетногоСчета(ВыбранноеЗначение, Объект.Валюта, Объект.РасчетныйСчетКонтрагента);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетныйСчетОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ВалютаВыбранногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Валюта");
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
		
		ВалютаРасчетногоСчетаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрагента, "Валюта");
			
		Если ВалютаРасчетногоСчетаКонтрагента <> ВалютаВыбранногоСчета Тогда
			
			Если Вопрос("Валюта " + ВалютаРасчетногоСчетаКонтрагента + " расчетного счета отправителя не соответствует валюте " + ВалютаВыбранногоСчета + " расчетного счёта " + ВыбранноеЗначение + ". Расчетный счёт отправителя будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Объект.РасчетныйСчетКонтрагента = Неопределено;			
			Иначе
				ВыбранноеЗначение = Объект.РасчетныйСчет;			
			КонецЕсли;
			
		КонецЕсли;
			
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОБРАБОТЧИКИ_КОМАНД

&НаКлиенте
Процедура КомандаВыбратьИсполнителяПоДенежнымСредствам(Команда)
	
	РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствам(ЭтаФорма, Ложь);
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчет) И ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
		
		ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
		ВалютаРасчетногоСчетаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрагента, "Валюта");
		
		Если ВалютаРасчетногоСчета <> ВалютаРасчетногоСчетаКонтрагента Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Расчетный счет отправителя был очищен, т.к. валюта " + ВалютаРасчетногоСчетаКонтрагента + " отличается от валюты расчетного счета исполнителя (получателя) " + ВалютаРасчетногоСчета + ".",,, "Объект.РасчетныйСчетКонтрагента");
			Объект.РасчетныйСчетКонтрагента = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
	
	РасчетныйСчетПриИзменении(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбратьДанныеПоКонтрагенту(Команда)
		
	СоответствиеРеквизитовИсполнителяИДокумента = Новый Структура("РасчетныйСчет", "РасчетныйСчетКонтрагента");
	
	Если ЭтаФорма.ТипПередачи = 2
		Или ЭтаФорма.ТипПередачи = 0 
			И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")
			И ЗначениеЗаполнено(Объект.Основание) Тогда
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(ЭтаФорма, Объект.Контрагент, Ложь, СоответствиеРеквизитовИсполнителяИДокумента, Неопределено);	
	Иначе
					
		ЮрФизЛицоКлиента = РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
		РаботаСДокументамиКлиент.ВыбратьИсполнителяПоДенежнымСредствамДляВводовВыводовДенежныхСредств(ЭтаФорма, ЮрФизЛицоКлиента, ЭтаФорма.ТипПередачи = 1, СоответствиеРеквизитовИсполнителяИДокумента, ?(ЭтаФорма.ТипПередачи = 1, "КонтрагентДоговорТекстом", Неопределено));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
		
		ВалютаРасчетногоСчетаКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрагента, "Валюта");
		
		Если ЗначениеЗаполнено(Объект.РасчетныйСчет) Тогда
			
			ВалютаРасчетногоСчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчет, "Валюта");
			
			Если ВалютаРасчетногоСчетаКонтрагента <> ВалютаРасчетногоСчета Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Валюта " + ВалютаРасчетногоСчетаКонтрагента + " расчетного счета " + Объект.РасчетныйСчетКонтрагента + " отличается от валюты " + ВалютаРасчетногоСчета + " расчетного счета получателя.",,, "Объект.РасчетныйСчетКонтрагента");
				Объект.РасчетныйСчетКонтрагента = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтаФорма.ТипПередачи <> 1 Тогда
		УстановитьТекстКонтрагентаДоговора();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СЛУЖЕБНЫЕ_ПРОЦЕДУРЫ_И_ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Форма)
	
	ДанныеОбъекта = Форма.Объект;
	Элементы	  = Форма.Элементы;
							
	Элементы.Пай.Видимость       = (ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваДоходПоПаямЗПИФ"));
		
	БезналичнаяФормаДенежныхСредств = (ДанныеОбъекта.ФормаДенежныхСредств = ПредопределенноеЗначение("Перечисление.ФормыДенежныхСредств.Безналичная"));
	
	Элементы.ГруппаБезналичныеДенежныеСредства.Видимость = БезналичнаяФормаДенежныхСредств;
	Элементы.РасчетныйСчетКонтрагента.Видимость          = БезналичнаяФормаДенежныхСредств;
	Элементы.СтрокаБанковскойВыписки.Видимость           = БезналичнаяФормаДенежныхСредств;
	
	Элементы.Касса.Видимость = Не БезналичнаяФормаДенежныхСредств;
		
	Если Элементы.ГруппаБезналичныеДенежныеСредства.Видимость Тогда
		Элементы.ОплатаЧерезБрокера.Видимость = (ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваПроцентЗаПользованиеДенежнымиСредствами"));
		Элементы.Брокер.Видимость             = (Форма.ОплатаЧерезБрокера = 1);
		
		РаботаСДокументамиКлиентСервер.НастроитьВидимостьИДоступностьРасчетногоСчетаИСвязанныхРеквизитов(Форма);
	КонецЕсли;		
	
	// параметры выбора счета д/у
	МассивПараметровВыбора = Новый Массив;
	
	Если ДанныеОбъекта.ВидОперации = ПредопределенноеЗначение("Справочник.ВидыОперацийПриВводеВыводеДенежныхСредств.ПолученыСредстваОтПайщика") Тогда
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговораДоверительногоУправления", ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда")));		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.Основание) Тогда
		Элементы.Основание.АвтоОтметкаНезаполненного = РаботаСДокументамиКлиентСервер.РеквизитОбязателенДляЗаполнения(ДанныеОбъекта, "Основание");
	КонецЕсли;
 
	Элементы.СчетДоверительногоУправления.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
	ТребуетсяПроверкаЗаполненияКонтрагента = РаботаСДокументамиКлиентСервер.ТребуетсяПроверкаЗаполненияЗначенияКонтрагента(ДанныеОбъекта);
		
	Элементы.КонтрагентДоговорТекстом.АвтоОтметкаНезаполненного	= ТребуетсяПроверкаЗаполненияКонтрагента;
	Элементы.РасчетныйСчет.АвтоОтметкаНезаполненного			= ТребуетсяПроверкаЗаполненияКонтрагента;
	Элементы.РасчетныйСчетКонтрагента.АвтоОтметкаНезаполненного	= ТребуетсяПроверкаЗаполненияКонтрагента;
	Элементы.Контрагент.АвтоОтметкаНезаполненного               = ТребуетсяПроверкаЗаполненияКонтрагента;
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеОбъекта.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	
	СчетДУСобственныйИлиПИФ	= ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный")
							Или ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда");

	Элементы.ТипПередачи.Видимость = Не СчетДУСобственныйИлиПИФ;
	
	Элементы.Контрагент.ТолькоПросмотр = Форма.ТипПередачи < 2 И Не СчетДУСобственныйИлиПИФ;
	
	Элементы.КомандаВыбратьДанныеПоКонтрагенту.Доступность 				= Не Форма.ТолькоПросмотр;
	Элементы.КомандаВыбратьИсполнителяПоДенежнымСредствам.Доступность 	= Не Форма.ТолькоПросмотр;
	
КонецПроцедуры // НастроитьВидимостьДоступность

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто1",
		"Субконто2",
		"Субконто3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЕПС(Форма, Организация, Счет)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"СубконтоЕПС1",
		"СубконтоЕПС2",
		"СубконтоЕПС3",
		"Подразделение");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Организация, Счет, Форма, ПоляФормы);

КонецПроцедуры

&НаСервере
Процедура НастроитьПараметрыОтбораОснования()
	
	КлиентУправления = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(Объект.СчетДоверительногоУправления, Объект.Дата);
	
	МассивПараметровВыбора = Новый Массив;
	
	Если ТипЗнч(КлиентУправления) = Тип("СправочникСсылка.ПаевыеИнвестиционныеФонды") Тогда
		                                                                      		
		МассивПИФов	= Новый Массив;
		ВидЗаявки	= Неопределено;
		
		Если Объект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВводДенежныхСредствПриОбменеПаев Тогда
			
			// Нужно добавить ПИФы, указанные в заявках на обмен
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	ЗаявкаПайщика.ПаевойИнвестиционныйФонд КАК ПаевойИнвестиционныйФонд
				|ИЗ
				|	Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
				|ГДЕ
				|	ЗаявкаПайщика.Организация = &Организация
				|	И ЗаявкаПайщика.ПаевойИнвестиционныйФондДляОбменаПаев = &ПаевойИнвестиционныйФондДляОбменаПаев
				|	И НЕ ЗаявкаПайщика.ПометкаУдаления
				|	И ЗаявкаПайщика.ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.ВидыЗаявокПайщиков.Обмен)");
			
			Запрос.УстановитьПараметр("Организация",							Объект.Организация);
			Запрос.УстановитьПараметр("ПаевойИнвестиционныйФондДляОбменаПаев",	КлиентУправления);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				МассивПИФов.Добавить(Выборка.ПаевойИнвестиционныйФонд);
			КонецЦикла;
			
			ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Обмен;
			
		Иначе
			
			МассивПИФов.Добавить(КлиентУправления);	
			
			Если Объект.ВидОперации = Справочники.ВидыОперацийПриВводеВыводеДенежныхСредств.ВозвратДенежныхСредствПриНеудачномВыводеДенежныхСредствПайщику Тогда
				ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Погашение;
			Иначе			
				ВидЗаявки = Перечисления.ВидыЗаявокПайщиков.Зачисление;
			КонецЕсли;
		
		КонецЕсли;
	    
		МассивПараметровВыбора.Добавить(
			Новый ПараметрВыбора("Отбор.ПаевойИнвестиционныйФонд", МассивПИФов));		
		
		МассивПараметровВыбора.Добавить(
			Новый ПараметрВыбора("Отбор.ВидЗаявки", ВидЗаявки));
			
	КонецЕсли;

	МассивПараметровВыбора.Добавить(
			Новый ПараметрВыбора("Отбор.Организация", Объект.Организация));
	
	Элементы.Основание.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ЭтаФорма.СтрокаБанковскойВыписки = РаботаСБанковскимиВыпискамиКлиентСервер.ПолучитьПредставлениеСтрокиБанковскойВыписки(Объект.СтрокаБанковскойВыписки);
	
	ЭтаФорма.ОплатаЧерезБрокера           = ?(ЗначениеЗаполнено(Объект.Брокер), 1, 0);
	ЭтаФорма.ДетализацияПоРасчетномуСчету = РаботаСДокументами.ТребуетсяДетализацияПоРасчетномуСчету(Объект);
	
	Если ЗначениеЗаполнено(Объект.ВидОперации) и НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.КоррСчет = БухгалтерскийУчет.ОпределитьСчетРасчетовПоДоговоруДоверительногоУправления(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.ВидОперации);	
		ЗаполнитьСубконто1НаСервере();
	КонецЕсли; 
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления") <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
	
		ЭтаФорма.ТипПередачи = РаботаСДокументами.ПолучитьТипПередачиДляВводаВыводаАктивов(Объект.Дата, Объект.Организация, Объект.СчетДоверительногоУправления, Объект.Контрагент);
		
	КонецЕсли;
	
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.Организация, Объект.КоррСчет);
	УстановитьЗаголовкиИДоступностьСубконтоЕПС(ЭтаФорма, Объект.Организация, Объект.КоррСчетЕПС);
	
	НастроитьПараметрыОтбораОснования();
	
	НастроитьВидимостьИДоступность(ЭтаФорма);
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСубконто1НаСервере()
		
	Объект.Субконто1 = РаботаСДокументами.Субконто1ДляВводаВыводаДенежныхСредств(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоБухгалтерскомуУчету()

	РаботаСФормамиКлиент.ПровестиПоБухгалтерскомуУчету(ЭтаФорма); 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодтверждениеОперацииНаСервере()
	РаботаСДокументами.ЗаполнитьПодтверждениеОперации(ЭтаФорма, Объект.Ссылка);		
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьНачислениеВознагражденияЗаРазмещение(ВводДенежныхСредств)
	
	НачатьТранзакцию();
	
	НачислениеВознаграждения = Документы.НачислениеЗадолженности.СоздатьДокумент();
	НачислениеВознаграждения.Заполнить(ВводДенежныхСредств);
	
	Если Не НачислениеВознаграждения.ПроверитьЗаполнение() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать документ начисления вознаграждения за размещение");
		ОтменитьТранзакцию();
		Возврат Документы.НачислениеЗадолженности.ПустаяСсылка();
	КонецЕсли;
	
	Попытка
		НачислениеВознаграждения.Записать(РежимЗаписиДокумента.Проведение);
		
		ЗафиксироватьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + НачислениеВознаграждения, НачислениеВознаграждения.Ссылка);
		
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ начисления вознаграждения за размещение. Система сообщает: " + ОписаниеОшибки());
		
		Возврат Документы.НачислениеЗадолженности.ПустаяСсылка();
		
	КонецПопытки;
	
	Возврат НачислениеВознаграждения.Ссылка;
	
КонецФункции // СоздатьПриходПроцентовМНО

&НаСервереБезКонтекста
Функция НайтиНачислениеВознагражденияЗаРазмещение(НачислениеВознаграждения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НачислениеЗадолженностиОснования.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.НачислениеЗадолженности.Основания КАК НачислениеЗадолженностиОснования
		|ГДЕ
		|	НачислениеЗадолженностиОснования.Основание = &Основание
		|	И НачислениеЗадолженностиОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВознаграждениюУправляющегоПлатаЗаРазмещение)
		|	И НЕ НачислениеЗадолженностиОснования.Ссылка.ПометкаУдаления";
		
	Запрос.УстановитьПараметр("Основание", НачислениеВознаграждения);
	
	Выборка = Запрос.Выполнить().Выбрать();

	Если      Выборка.Количество() = 0 Тогда
		Возврат Документы.НачислениеЗадолженности.ПустаяСсылка();
	ИначеЕсли Выборка.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено более одного начисления вознаграждения за размещение. Обрабатываться будет только первый из них");
	КонецЕсли;
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции // НайтиПодчиненныйПриходПроцентовМНО

&НаСервереБезКонтекста
Функция НачислениеВознагражденияЗаРазмещениеТребуетСинхронизации(НачислениеВознаграждения, Дата, СчетДоверительногоУправления)
	
	Возврат Документы.ВводДенежныхСредств.НачислениеВознагражденияЗаРазмещениеТребуетСинхронизации(НачислениеВознаграждения, Дата, СчетДоверительногоУправления);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТребуетсяНачислениеВознагражденияЗаРазмещение(Дата, СчетДоверительногоУправления, ВидОперации)
	
	Возврат Документы.ВводДенежныхСредств.ТребуетсяНачислениеВознагражденияЗаРазмещение(Дата, СчетДоверительногоУправления, ВидОперации);
	
КонецФункции // ТребуетсяНачислениеВознагражденияЗаРазмещение

&НаКлиенте
Процедура УстановитьТекстКонтрагентаДоговора()
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Если ЗначениеЗаполнено(Объект.КонтрагентДоговорТекстом) Тогда
			Объект.КонтрагентДоговорТекстом = "";
		КонецЕсли;
		Возврат;
	КонецЕсли;
		
	Объект.КонтрагентДоговорТекстом = РаботаСДокументами.ПолучитьТекстКонтрагентаДляВводовВыводовДенежныхСредств(											
											Объект.Организация, 
											Объект.Контрагент,											
											Объект.РасчетныйСчетКонтрагента, 
											ЭтаФорма.ТипПередачи = 1, 
											Объект.Дата);	
	
КонецПроцедуры
												
&НаКлиенте
Процедура ОбработатьРасчетныйСчетПриИзмененииКонтрагента()
	
	Если Не ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент)
		И ЗначениеЗаполнено(Объект.РасчетныйСчетКонтрагента) Тогда
		Объект.РасчетныйСчетКонтрагента = "";
		Объект.КонтрагентДоговорТекстом = "";
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.РасчетныйСчетКонтрагента, "ЮрФизЛицо") <> Объект.Контрагент Тогда
		Объект.РасчетныйСчетКонтрагента = "";
		Объект.КонтрагентДоговорТекстом = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТипПередачиИКонтрагента()
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетДоверительногоУправления, "ВидДоговораДоверительногоУправления");
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.Собственный") Тогда
		ЭтаФорма.ТипПередачи = 0;
	ИначеЕсли ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда") Тогда
		
		Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЗаявкаПайщика")
			И ЗначениеЗаполнено(Объект.Основание)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Основание, "ВидЗаявки") = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Обмен") Тогда
			ЭтаФорма.ТипПередачи = 1;
		Иначе
			ЭтаФорма.ТипПередачи = 0;
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.Контрагент = РаботаСДокументамиКлиент.ПолучитьКонтрагентаДляВводаВыводаАктивов(
											Объект.Дата,
											ЭтаФорма.ТипПередачи,
											Объект.Организация,
											Объект.СчетДоверительногоУправления,
											?(ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда"),
												Объект.Основание,
												Неопределено));
	
	УстановитьТекстКонтрагентаДоговора();
	
	Объект.РасчетныйСчетКонтрагента = Неопределено;

КонецПроцедуры	

#КонецОбласти
